---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfileWithLips
source: html/64866cd8-441c-e428-a754-2ea96cb97286.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfileWithLips

Defines parameters for C Profile with lips structural section.

## Syntax (C#)
```csharp
public class StructuralSectionCProfileWithLips : StructuralSectionGeneralC
```